"""**3. Łączenie DataFrames**

Wczytaj zbiory danych `rating.csv` oraz `parking.csv`. Spróbuj połączyć je wykorzystując metodę `merge`. Pamiętaj o odpowiedniej nazwie kol
"""

In [2]:
import pandas as pd

In [3]:
rating = pd.read_csv('ML-datasets-master/rating.csv')
rating.sample(5)

    userID  placeID  rating  food_rating  service_rating
865  U1029   132921       1            1               1
456  U1036   135065       0            0               0
199  U1064   135042       1            2               1
549  U1045   132834       1            1               1
813  U1089   135058       1            1               1

In [4]:
parking = pd.read_csv('ML-datasets-master/parking.csv')
parking.sample(5)

     placeID parking_lot
660   132297      public
349   132828         yes
671   132243      public
336   132841        none
663   132292      public

In [5]:
merged = rating.merge(parking, how='left', on='placeID')

In [6]:
merged.sample(5)

     userID  placeID  rating  food_rating  service_rating parking_lot
249   U1056   135051       2            2               2        none
2     U1077   132825       2            2               2        none
511   U1104   132825       1            2               1        none
1022  U1006   132922       2            1               2        none
1118  U1050   132560       0            2               0      public